class API {
    static tests = {
        1: {
            whom: "baby",
            greeting: "Друг, теперь нам необходимо узнать, насколько ты уже знаешь о безопасности в интернете.\nДавай пройдем небольшой тест 😉",
            questions: [
                {
                    title: "Как меня зовут?",
                    answers: [ "Антон", "Егор", "Влад", "Кирилл" ],
                    rightAnswer: 3
                }
            ],
        },
        2: {
            whom: "parent",
            greeting: "Друг, теперь нам необходимо узнать, насколько ты уже знаешь о безопасности в интернете.\nДавай пройдем небольшой тест 😉",
            questions: [
                {
                    title: "Как меня зовут?",
                    answers: [ "Антон", "Егор", "Влад", "Кирилл" ],
                    rightAnswer: 3
                }
            ],
        }
    };

    static getTest = (id) => {
        if(this.tests[id] === undefined) {
            console.log(`😱 TestsAPI failed get test by id ${id}!`);
            return null;
        }

        return this.tests[id];
    }
}

export default API;